rails_quotes_api/app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      @quote = Quote.find(params[:id])

INSERT INTO "quotes" ("author", "content", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Hamlet"], ["content", "Words, words, words."], ["category", "shakespeare"], ["created_at", "2019-05-28 16:35:16.245429"], ["updated_at", "2019-05-28 16:35:16.245429"]]
SELECT "quotes".* FROM "quotes"
---
  def create
    begin
      @quote = Quote.new(quote_params)
      if @quote.save
        @quotes = Quote.all